99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_request_response.c
#include "utils/esp32_mquickjs_request_response.h"
#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_stream.h"

#include <ctype.h>
#include <string.h>

#include "esp_heap_caps.h"

static bool rr_is_object(JSContext *ctx, JSValue value)
{
    return JS_GetClassID(ctx, value) >= 0;
}

static JSValue rr_call_function(JSContext *ctx,
                                JSValue func,
                                JSValue this_val,
                                int argc,
                                JSValue *argv)
{
    return esp32_mquickjs_call(ctx,
                               esp32_mquickjs_get_active_runtime(),
                               func,
                               this_val,
                               argc,
                               argv);
}

static char *rr_strdup(const char *value)
{
    size_t len;
    char *copy;

    if (value == NULL) {
        return NULL;
    }
    len = strlen(value);
    copy = heap_caps_malloc(len + 1, MALLOC_CAP_8BIT);
    if (copy == NULL) {
        return NULL;
    }
    memcpy(copy, value, len + 1);
    return copy;
}

static char *rr_value_to_string_copy(JSContext *ctx, JSValue value)
{
    JSCStringBuf value_buf;
    const char *text = JS_ToCString(ctx, value, &value_buf);

    return text != NULL ? rr_strdup(text) : NULL;
}

bool esp32_mquickjs_is_headers_object(JSContext *ctx, JSValue value)
{
    return rr_is_object(ctx, value) && JS_GetClassID(ctx, value) == JS_CLASS_HEADERS;
}

bool esp32_mquickjs_is_request_object(JSContext *ctx, JSValue value)
{
    return rr_is_object(ctx, value) && JS_GetClassID(ctx, value) == JS_CLASS_REQUEST;
}

bool esp32_mquickjs_is_response_object(JSContext *ctx, JSValue value)
{
    return rr_is_object(ctx, value) && JS_GetClassID(ctx, value) == JS_CLASS_RESPONSE;
}

static char *rr_normalize_header_key(const char *value)
{
    size_t len;
    size_t i;
    char *normalized;

    if (value == NULL) {
        return NULL;
    }
    len = strlen(value);
    normalized = heap_caps_malloc(len + 1, MALLOC_CAP_8BIT);
    if (normalized == NULL) {
        return NULL;
    }
    for (i = 0; i < len; ++i) {
        normalized[i] = (char)tolower((unsigned char)value[i]);
    }
    normalized[len] = '\0';
    return normalized;
}

static char *rr_url_decode(const char *value)
{
    size_t len;
    size_t i;
    size_t j = 0;
    char *out;

    if (value == NULL) {
        return rr_strdup("");
    }

    len = strlen(value);
    out = heap_caps_malloc(len + 1, MALLOC_CAP_8BIT);
    if (out == NULL) {
        return NULL;
    }

    for (i = 0; i < len; ++i) {
        if (value[i] == '%' && i + 2 < len) {
            int hi = isdigit((unsigned char)value[i + 1]) ? value[i + 1] - '0'
                     : (tolower((unsigned char)value[i + 1]) >= 'a' && tolower((unsigned char)value[i + 1]) <= 'f')
                           ? tolower((unsigned char)value[i + 1]) - 'a' + 10
                           : -1;
            int lo = isdigit((unsigned char)value[i + 2]) ? value[i + 2] - '0'
                     : (tolower((unsigned char)value[i + 2]) >= 'a' && tolower((unsigned char)value[i + 2]) <= 'f')
                           ? tolower((unsigned char)value[i + 2]) - 'a' + 10
                           : -1;

            if (hi >= 0 && lo >= 0) {
                out[j++] = (char)((hi << 4) | lo);
                i += 2;
                continue;
            }
        }
        out[j++] = value[i] == '+' ? ' ' : value[i];
    }
    out[j] = '\0';
    return out;
}

static int rr_copy_object_properties(JSContext *ctx,
                                     JSValue *source_obj,
                                     JSValue *target_obj,
                                     bool normalize_keys)
{
    JSGCRef global_ref;
    JSGCRef object_ref;
    JSGCRef keys_ref;
    JSGCRef array_ref;
    JSGCRef length_ref;
    JSValue *global_obj;
    JSValue *object_ctor;
    JSValue *keys_fn;
    JSValue *keys_array;
    JSValue *length_value;
    int length = 0;
    int i;
    int result = -1;

    global_obj = JS_PushGCRef(ctx, &global_ref);
    object_ctor = JS_PushGCRef(ctx, &object_ref);
    keys_fn = JS_PushGCRef(ctx, &keys_ref);
    keys_array = JS_PushGCRef(ctx, &array_ref);
    length_value = JS_PushGCRef(ctx, &length_ref);
    *global_obj = JS_GetGlobalObject(ctx);
    *object_ctor = JS_UNDEFINED;
    *keys_fn = JS_UNDEFINED;
    *keys_array = JS_UNDEFINED;
    *length_value = JS_UNDEFINED;

    if (JS_IsException(*global_obj)) {
        goto done;
    }
    *object_ctor = JS_GetPropertyStr(ctx, *global_obj, "Object");
    if (JS_IsException(*object_ctor) || !JS_IsFunction(ctx, *object_ctor)) {
        goto done;
    }
    *keys_fn = JS_GetPropertyStr(ctx, *object_ctor, "keys");
    if (JS_IsException(*keys_fn) || !JS_IsFunction(ctx, *keys_fn)) {
        goto done;
    }
    *keys_array = rr_call_function(ctx, *keys_fn, *object_ctor, 1, source_obj);
    if (JS_IsException(*keys_array)) {
        goto done;
    }
    *length_value = JS_GetPropertyStr(ctx, *keys_array, "length");
    if (JS_IsException(*length_value) || JS_ToInt32(ctx, &length, *length_value) != 0 || length < 0) {
        goto done;
    }

    for (i = 0; i < length; ++i) {
        JSGCRef key_ref;
        JSGCRef value_ref;
        JSValue *key_value;
        JSValue *value_value;
        JSCStringBuf key_buf;
        JSCStringBuf value_buf;
        const char *key_str;
        const char *value_str;
        char *prop_name = NULL;

        key_value = JS_PushGCRef(ctx, &key_ref);
        value_value = JS_PushGCRef(ctx, &value_ref);
        *key_value = JS_GetPropertyUint32(ctx, *keys_array, (uint32_t)i);
        *value_value = JS_UNDEFINED;
        if (JS_IsException(*key_value)) {
            JS_PopGCRef(ctx, &value_ref);
            JS_PopGCRef(ctx, &key_ref);
            goto done;
        }

        key_str = JS_ToCString(ctx, *key_value, &key_buf);
        if (key_str == NULL) {
            JS_PopGCRef(ctx, &value_ref);
            JS_PopGCRef(ctx, &key_ref);
            goto done;
        }
        prop_name = normalize_keys ? rr_normalize_header_key(key_str) : rr_strdup(key_str);
        if (prop_name == NULL) {
            JS_PopGCRef(ctx, &value_ref);
            JS_PopGCRef(ctx, &key_ref);
            JS_ThrowOutOfMemory(ctx);
            goto done;
        }

        *value_value = JS_GetPropertyStr(ctx, *source_obj, key_str);
        if (JS_IsException(*value_value)) {
            heap_caps_free(prop_name);
            JS_PopGCRef(ctx, &value_ref);
            JS_PopGCRef(ctx, &key_ref);
            goto done;
        }
        if (JS_IsUndefined(*value_value)) {
            heap_caps_free(prop_name);
            JS_PopGCRef(ctx, &value_ref);
            JS_PopGCRef(ctx, &key_ref);
            continue;
        }

        value_str = JS_ToCString(ctx, *value_value, &value_buf);
        if (value_str == NULL) {
            heap_caps_free(prop_name);
            JS_PopGCRef(ctx, &value_ref);
            JS_PopGCRef(ctx, &key_ref);
            goto done;
        }

