99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_request_response.c
        if (!esp32_mquickjs_set_property(ctx, *target_obj, prop_name, JS_NewString(ctx, value_str))) {
            heap_caps_free(prop_name);
            JS_PopGCRef(ctx, &value_ref);
            JS_PopGCRef(ctx, &key_ref);
            goto done;
        }
        heap_caps_free(prop_name);
        JS_PopGCRef(ctx, &value_ref);
        JS_PopGCRef(ctx, &key_ref);
    }

    result = 0;

done:
    JS_PopGCRef(ctx, &length_ref);
    JS_PopGCRef(ctx, &array_ref);
    JS_PopGCRef(ctx, &keys_ref);
    JS_PopGCRef(ctx, &object_ref);
    JS_PopGCRef(ctx, &global_ref);
    return result;
}

static JSValue rr_get_object_keys(JSContext *ctx, JSValue *object_value)
{
    JSGCRef global_ref;
    JSGCRef object_ref;
    JSGCRef keys_ref;
    JSGCRef array_ref;
    JSValue *global_obj;
    JSValue *object_ctor;
    JSValue *keys_fn;
    JSValue *keys_array;

    global_obj = JS_PushGCRef(ctx, &global_ref);
    object_ctor = JS_PushGCRef(ctx, &object_ref);
    keys_fn = JS_PushGCRef(ctx, &keys_ref);
    keys_array = JS_PushGCRef(ctx, &array_ref);
    *global_obj = JS_GetGlobalObject(ctx);
    *object_ctor = JS_UNDEFINED;
    *keys_fn = JS_UNDEFINED;
    *keys_array = JS_UNDEFINED;

    if (JS_IsException(*global_obj)) {
        goto fail;
    }
    *object_ctor = JS_GetPropertyStr(ctx, *global_obj, "Object");
    if (JS_IsException(*object_ctor) || !JS_IsFunction(ctx, *object_ctor)) {
        goto fail;
    }
    *keys_fn = JS_GetPropertyStr(ctx, *object_ctor, "keys");
    if (JS_IsException(*keys_fn) || !JS_IsFunction(ctx, *keys_fn)) {
        goto fail;
    }
    *keys_array = rr_call_function(ctx, *keys_fn, *object_ctor, 1, object_value);
    if (JS_IsException(*keys_array)) {
        goto fail;
    }

    JS_PopGCRef(ctx, &keys_ref);
    JS_PopGCRef(ctx, &object_ref);
    JS_PopGCRef(ctx, &global_ref);
    return JS_PopGCRef(ctx, &array_ref);

fail:
    JS_PopGCRef(ctx, &array_ref);
    JS_PopGCRef(ctx, &keys_ref);
    JS_PopGCRef(ctx, &object_ref);
    JS_PopGCRef(ctx, &global_ref);
    return JS_EXCEPTION;
}

static JSValue rr_get_headers_store(JSContext *ctx, JSValue headers_value)
{
    if (!esp32_mquickjs_is_headers_object(ctx, headers_value)) {
        return JS_EXCEPTION;
    }
    return JS_GetPropertyStr(ctx, headers_value, ESP32_MQUICKJS_HEADERS_STORE_KEY);
}

static JSValue rr_get_global_object(JSContext *ctx)
{
    return JS_GetGlobalObject(ctx);
}

JSValue esp32_mquickjs_headers_to_plain_object(JSContext *ctx, JSValue headers_value)
{
    JSGCRef headers_ref;
    JSGCRef source_ref;
    JSGCRef plain_ref;
    JSValue *headers_obj;
    JSValue *source_obj;
    JSValue *plain_obj;

    plain_obj = JS_PushGCRef(ctx, &plain_ref);
    headers_obj = JS_PushGCRef(ctx, &headers_ref);
    source_obj = JS_PushGCRef(ctx, &source_ref);
    *plain_obj = JS_UNDEFINED;
    *headers_obj = headers_value;
    *source_obj = JS_UNDEFINED;
    *plain_obj = JS_NewObject(ctx);
    if (JS_IsException(*plain_obj)) {
        goto fail;
    }

    if (esp32_mquickjs_is_headers_object(ctx, *headers_obj)) {
        *source_obj = rr_get_headers_store(ctx, *headers_obj);
        if (JS_IsException(*source_obj)) {
            goto fail;
        }
    } else if (rr_is_object(ctx, *headers_obj)) {
        *source_obj = *headers_obj;
    } else if (JS_IsUndefined(*headers_obj) || JS_IsNull(*headers_obj)) {
        JS_PopGCRef(ctx, &source_ref);
        JS_PopGCRef(ctx, &headers_ref);
        return JS_PopGCRef(ctx, &plain_ref);
    } else {
        JS_ThrowTypeError(ctx, "Headers expects a plain object or Headers");
        goto fail;
    }

    if (rr_copy_object_properties(ctx, source_obj, plain_obj, false) != 0) {
        goto fail;
    }

    JS_PopGCRef(ctx, &source_ref);
    JS_PopGCRef(ctx, &headers_ref);
    return JS_PopGCRef(ctx, &plain_ref);

fail:
    JS_PopGCRef(ctx, &source_ref);
    JS_PopGCRef(ctx, &headers_ref);
    JS_PopGCRef(ctx, &plain_ref);
    return JS_EXCEPTION;
}

JSValue esp32_mquickjs_make_headers_object(JSContext *ctx, JSValue global_obj, JSValue init_value)
{
    JSGCRef init_ref;
    JSGCRef headers_ref;
    JSGCRef store_ref;
    JSGCRef plain_ref;
    JSValue *init_obj;
    JSValue *headers_obj;
    JSValue *store_obj;
    JSValue *plain_obj;

    (void)global_obj;
    headers_obj = JS_PushGCRef(ctx, &headers_ref);
    init_obj = JS_PushGCRef(ctx, &init_ref);
    store_obj = JS_PushGCRef(ctx, &store_ref);
    plain_obj = JS_PushGCRef(ctx, &plain_ref);
    *headers_obj = JS_UNDEFINED;
    *init_obj = init_value;
    *store_obj = JS_UNDEFINED;
    *plain_obj = JS_UNDEFINED;
    *headers_obj = JS_NewObjectClassUser(ctx, JS_CLASS_HEADERS);
    *store_obj = JS_NewObject(ctx);
    if (JS_IsException(*headers_obj) || JS_IsException(*store_obj)) {
        goto fail;
    }

    if (!esp32_mquickjs_set_property(ctx, *headers_obj, ESP32_MQUICKJS_HEADERS_STORE_KEY, *store_obj)) {
        goto fail;
    }

    if (!JS_IsUndefined(*init_obj) && !JS_IsNull(*init_obj)) {
        *plain_obj = esp32_mquickjs_headers_to_plain_object(ctx, *init_obj);
        if (JS_IsException(*plain_obj) ||
            rr_copy_object_properties(ctx, plain_obj, store_obj, true) != 0) {
            goto fail;
        }
    }

    JS_PopGCRef(ctx, &plain_ref);
    JS_PopGCRef(ctx, &store_ref);
    JS_PopGCRef(ctx, &init_ref);
    return JS_PopGCRef(ctx, &headers_ref);

fail:
    JS_PopGCRef(ctx, &plain_ref);
    JS_PopGCRef(ctx, &store_ref);
    JS_PopGCRef(ctx, &init_ref);
    JS_PopGCRef(ctx, &headers_ref);
    return JS_EXCEPTION;
}

static JSValue rr_make_query_object(JSContext *ctx, const char *query_string)
{
    JSGCRef query_ref;
    JSValue *query_obj;
    const char *cursor;

    query_obj = JS_PushGCRef(ctx, &query_ref);
    *query_obj = JS_NewObject(ctx);
    if (JS_IsException(*query_obj)) {
        goto fail;
    }

    if (query_string == NULL || query_string[0] == '\0') {
        return JS_PopGCRef(ctx, &query_ref);
    }

    cursor = query_string;
    while (*cursor != '\0') {
        const char *segment_start = cursor;
        const char *separator;
        const char *equals;
        size_t key_len;
        size_t value_len;
        char *key_raw;
        char *value_raw;
        char *key;
        char *value;

        while (*cursor != '\0' && *cursor != '&') {
            cursor++;
        }
        separator = cursor;
        if (*cursor == '&') {
            cursor++;
        }

        equals = memchr(segment_start, '=', (size_t)(separator - segment_start));
        key_len = equals != NULL ? (size_t)(equals - segment_start) : (size_t)(separator - segment_start);
        value_len = equals != NULL ? (size_t)(separator - equals - 1) : 0;

