99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_request_response.c
        key_raw = heap_caps_malloc(key_len + 1, MALLOC_CAP_8BIT);
        value_raw = heap_caps_malloc(value_len + 1, MALLOC_CAP_8BIT);
        if (key_raw == NULL || value_raw == NULL) {
            heap_caps_free(key_raw);
            heap_caps_free(value_raw);
            JS_ThrowOutOfMemory(ctx);
            goto fail;
        }

        memcpy(key_raw, segment_start, key_len);
        key_raw[key_len] = '\0';
        memcpy(value_raw, equals != NULL ? equals + 1 : "", value_len);
        value_raw[value_len] = '\0';
        key = rr_url_decode(key_raw);
        value = rr_url_decode(value_raw);
        heap_caps_free(key_raw);
        heap_caps_free(value_raw);
        if (key == NULL || value == NULL) {
            heap_caps_free(key);
            heap_caps_free(value);
            JS_ThrowOutOfMemory(ctx);
            goto fail;
        }
        if (key[0] != '\0' &&
            !esp32_mquickjs_set_property(ctx, *query_obj, key, JS_NewString(ctx, value))) {
            heap_caps_free(key);
            heap_caps_free(value);
            goto fail;
        }
        heap_caps_free(key);
        heap_caps_free(value);
    }

    return JS_PopGCRef(ctx, &query_ref);

fail:
    JS_PopGCRef(ctx, &query_ref);
    return JS_EXCEPTION;
}

static int rr_parse_url_parts(JSContext *ctx,
                              const char *url,
                              char **out_path,
                              char **out_query_string,
                              JSValue *out_query)
{
    const char *path_start = NULL;
    const char *query_start = NULL;
    size_t path_len;
    char *path = NULL;
    char *query_string = NULL;

    *out_path = NULL;
    *out_query_string = NULL;
    *out_query = JS_UNDEFINED;

    if (url == NULL) {
        return -1;
    }

    if (strstr(url, "://") != NULL) {
        const char *after_scheme = strstr(url, "://") + 3;
        path_start = strchr(after_scheme, '/');
    } else {
        path_start = url[0] == '/' ? url : NULL;
    }

    if (path_start == NULL) {
        path = rr_strdup("/");
        if (path == NULL) {
            return -1;
        }
        *out_path = path;
        *out_query_string = rr_strdup("");
        if (*out_query_string == NULL) {
            heap_caps_free(path);
            *out_path = NULL;
            return -1;
        }
        return 0;
    }

    query_start = strchr(path_start, '?');
    path_len = query_start != NULL ? (size_t)(query_start - path_start) : strlen(path_start);
    path = heap_caps_malloc(path_len + 1, MALLOC_CAP_8BIT);
    if (path == NULL) {
        return -1;
    }
    memcpy(path, path_start, path_len);
    path[path_len] = '\0';
    query_string = rr_strdup(query_start != NULL ? query_start + 1 : "");
    if (query_string == NULL) {
        heap_caps_free(path);
        return -1;
    }

    *out_path = path;
    *out_query_string = query_string;
    *out_query = rr_make_query_object(ctx, query_string);
    if (JS_IsException(*out_query)) {
        heap_caps_free(path);
        heap_caps_free(query_string);
        *out_path = NULL;
        *out_query_string = NULL;
        return -1;
    }
    return 0;
}

JSValue esp32_mquickjs_make_text_body_stream(JSContext *ctx,
                                             JSValue global_obj,
                                             const char *text)
{
    size_t text_len = text != NULL ? strlen(text) : 0;
    char *copy = heap_caps_malloc(text_len + 1, MALLOC_CAP_8BIT);

    if (copy == NULL) {
        return JS_ThrowOutOfMemory(ctx);
    }
    if (text_len > 0) {
        memcpy(copy, text, text_len);
    }
    copy[text_len] = '\0';
    return esp32_mquickjs_stream_open_memory_owned(ctx, global_obj, copy, text_len);
}

static JSValue rr_body_to_stream(JSContext *ctx,
                                 JSValue global_obj,
                                 JSValue body_value,
                                 const char *api_name)
{
    JSCStringBuf body_buf;
    const char *body_str;

    if (JS_IsUndefined(body_value) || JS_IsNull(body_value)) {
        return esp32_mquickjs_make_text_body_stream(ctx, global_obj, "");
    }
    if (esp32_mquickjs_stream_is_stream(ctx, body_value)) {
        return esp32_mquickjs_stream_clone(ctx, global_obj, body_value);
    }
    if (!JS_IsString(ctx, body_value)) {
        return JS_ThrowTypeError(ctx, "%s expects body to be a string or Stream", api_name);
    }
    body_str = JS_ToCString(ctx, body_value, &body_buf);
    if (body_str == NULL) {
        return JS_EXCEPTION;
    }
    return esp32_mquickjs_make_text_body_stream(ctx, global_obj, body_str);
}

JSValue esp32_mquickjs_make_request_object(JSContext *ctx,
                                           JSValue global_obj,
                                           const char *method,
                                           const char *url,
                                           const char *path,
                                           const char *route,
                                           const char *mount_path,
                                           const char *relative_path,
                                           const char *query_string,
                                           JSValue query_value,
                                           JSValue headers_init,
                                           JSValue body_stream)
{
    JSGCRef request_ref;
    JSGCRef global_ref;
    JSGCRef query_input_ref;
    JSGCRef headers_input_ref;
    JSGCRef body_input_ref;
    JSGCRef query_ref;
    JSGCRef headers_ref;
    JSGCRef body_ref;
    JSValue *request_obj;
    JSValue *rooted_global;
    JSValue *query_input;
    JSValue *headers_input;
    JSValue *body_input;
    JSValue *query_obj;
    JSValue *headers_obj;
    JSValue *body_obj;

    request_obj = JS_PushGCRef(ctx, &request_ref);
    rooted_global = JS_PushGCRef(ctx, &global_ref);
    query_input = JS_PushGCRef(ctx, &query_input_ref);
    headers_input = JS_PushGCRef(ctx, &headers_input_ref);
    body_input = JS_PushGCRef(ctx, &body_input_ref);
    query_obj = JS_PushGCRef(ctx, &query_ref);
    headers_obj = JS_PushGCRef(ctx, &headers_ref);
    body_obj = JS_PushGCRef(ctx, &body_ref);
    *request_obj = JS_UNDEFINED;
    *rooted_global = global_obj;
    *query_input = query_value;
    *headers_input = headers_init;
    *body_input = body_stream;
    *query_obj = JS_UNDEFINED;
    *headers_obj = JS_UNDEFINED;
    *body_obj = JS_UNDEFINED;
    *request_obj = JS_NewObjectClassUser(ctx, JS_CLASS_REQUEST);
    if (JS_IsException(*request_obj)) {
        goto fail;
    }

    if (JS_IsUndefined(*query_input) || JS_IsNull(*query_input)) {
        *query_obj = rr_make_query_object(ctx, query_string != NULL ? query_string : "");
    } else {
        *query_obj = *query_input;
    }
    if (JS_IsException(*query_obj)) {
        goto fail;
    }

    *headers_obj = esp32_mquickjs_make_headers_object(ctx, *rooted_global, *headers_input);
    if (JS_IsException(*headers_obj)) {
        goto fail;
    }

    *body_obj = rr_body_to_stream(ctx, *rooted_global, *body_input, "Request");
    if (JS_IsException(*body_obj)) {
        goto fail;
    }

    if (!esp32_mquickjs_set_property(ctx, *request_obj, "method", JS_NewString(ctx, method != NULL ? method : "GET")) ||
        !esp32_mquickjs_set_property(ctx, *request_obj, "url", JS_NewString(ctx, url != NULL ? url : "")) ||
        !esp32_mquickjs_set_property(ctx, *request_obj, "path", JS_NewString(ctx, path != NULL ? path : "/")) ||
        !esp32_mquickjs_set_property(ctx, *request_obj, "route",
                                     JS_NewString(ctx, route != NULL ? route : (path != NULL ? path : "/"))) ||
        !esp32_mquickjs_set_property(ctx, *request_obj, "mountPath",
                                     JS_NewString(ctx, mount_path != NULL ? mount_path : "")) ||
        !esp32_mquickjs_set_property(ctx, *request_obj, "relativePath",
                                     JS_NewString(ctx, relative_path != NULL ? relative_path : "")) ||
        !esp32_mquickjs_set_property(ctx, *request_obj, "queryString",
                                     JS_NewString(ctx, query_string != NULL ? query_string : "")) ||
        !esp32_mquickjs_set_property(ctx, *request_obj, "query", *query_obj) ||
        !esp32_mquickjs_set_property(ctx, *request_obj, "headers", *headers_obj) ||
        !esp32_mquickjs_set_property(ctx, *request_obj, "body", *body_obj)) {
        goto fail;
    }
    *query_obj = JS_UNDEFINED;
    *headers_obj = JS_UNDEFINED;
    *body_obj = JS_UNDEFINED;

    JS_PopGCRef(ctx, &body_ref);
    JS_PopGCRef(ctx, &headers_ref);
    JS_PopGCRef(ctx, &query_ref);
    JS_PopGCRef(ctx, &body_input_ref);
    JS_PopGCRef(ctx, &headers_input_ref);
    JS_PopGCRef(ctx, &query_input_ref);
    JS_PopGCRef(ctx, &global_ref);
    return JS_PopGCRef(ctx, &request_ref);

