99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_request_response.c
fail:
    JS_PopGCRef(ctx, &body_ref);
    JS_PopGCRef(ctx, &headers_ref);
    JS_PopGCRef(ctx, &query_ref);
    JS_PopGCRef(ctx, &body_input_ref);
    JS_PopGCRef(ctx, &headers_input_ref);
    JS_PopGCRef(ctx, &query_input_ref);
    JS_PopGCRef(ctx, &global_ref);
    JS_PopGCRef(ctx, &request_ref);
    return JS_EXCEPTION;
}

static const char *rr_status_text(int32_t status)
{
    switch (status) {
    case 200:
        return "OK";
    case 201:
        return "Created";
    case 202:
        return "Accepted";
    case 204:
        return "No Content";
    case 301:
        return "Moved Permanently";
    case 302:
        return "Found";
    case 304:
        return "Not Modified";
    case 307:
        return "Temporary Redirect";
    case 308:
        return "Permanent Redirect";
    case 400:
        return "Bad Request";
    case 401:
        return "Unauthorized";
    case 403:
        return "Forbidden";
    case 404:
        return "Not Found";
    case 405:
        return "Method Not Allowed";
    case 408:
        return "Request Timeout";
    case 409:
        return "Conflict";
    case 413:
        return "Payload Too Large";
    case 429:
        return "Too Many Requests";
    case 500:
        return "Internal Server Error";
    case 502:
        return "Bad Gateway";
    case 503:
        return "Service Unavailable";
    case 504:
        return "Gateway Timeout";
    default:
        return "";
    }
}

JSValue esp32_mquickjs_make_response_object(JSContext *ctx,
                                            JSValue global_obj,
                                            int32_t status,
                                            const char *status_text,
                                            const char *url,
                                            JSValue headers_init,
                                            JSValue body_stream)
{
    JSGCRef response_ref;
    JSGCRef global_ref;
    JSGCRef headers_input_ref;
    JSGCRef body_input_ref;
    JSGCRef headers_ref;
    JSGCRef body_ref;
    JSValue *response_obj;
    JSValue *rooted_global;
    JSValue *headers_input;
    JSValue *body_input;
    JSValue *headers_obj;
    JSValue *body_obj;
    bool ok = status >= 200 && status < 300;

    response_obj = JS_PushGCRef(ctx, &response_ref);
    rooted_global = JS_PushGCRef(ctx, &global_ref);
    headers_input = JS_PushGCRef(ctx, &headers_input_ref);
    body_input = JS_PushGCRef(ctx, &body_input_ref);
    headers_obj = JS_PushGCRef(ctx, &headers_ref);
    body_obj = JS_PushGCRef(ctx, &body_ref);
    *response_obj = JS_UNDEFINED;
    *rooted_global = global_obj;
    *headers_input = headers_init;
    *body_input = body_stream;
    *headers_obj = JS_UNDEFINED;
    *body_obj = JS_UNDEFINED;
    *response_obj = JS_NewObjectClassUser(ctx, JS_CLASS_RESPONSE);
    if (JS_IsException(*response_obj)) {
        goto fail;
    }

    *headers_obj = esp32_mquickjs_make_headers_object(ctx, *rooted_global, *headers_input);
    if (JS_IsException(*headers_obj)) {
        goto fail;
    }
    *body_obj = rr_body_to_stream(ctx, *rooted_global, *body_input, "Response");
    if (JS_IsException(*body_obj)) {
        goto fail;
    }

    if (!esp32_mquickjs_set_property(ctx, *response_obj, "ok", JS_NewBool(ok)) ||
        !esp32_mquickjs_set_property(ctx, *response_obj, "status", JS_NewInt32(ctx, status)) ||
        !esp32_mquickjs_set_property(ctx, *response_obj, "statusText",
                                     JS_NewString(ctx, status_text != NULL ? status_text : rr_status_text(status))) ||
        !esp32_mquickjs_set_property(ctx, *response_obj, "url", JS_NewString(ctx, url != NULL ? url : "")) ||
        !esp32_mquickjs_set_property(ctx, *response_obj, "headers", *headers_obj) ||
        !esp32_mquickjs_set_property(ctx, *response_obj, "body", *body_obj)) {
        goto fail;
    }
    *headers_obj = JS_UNDEFINED;
    *body_obj = JS_UNDEFINED;

    JS_PopGCRef(ctx, &body_ref);
    JS_PopGCRef(ctx, &headers_ref);
    JS_PopGCRef(ctx, &body_input_ref);
    JS_PopGCRef(ctx, &headers_input_ref);
    JS_PopGCRef(ctx, &global_ref);
    return JS_PopGCRef(ctx, &response_ref);

fail:
    JS_PopGCRef(ctx, &body_ref);
    JS_PopGCRef(ctx, &headers_ref);
    JS_PopGCRef(ctx, &body_input_ref);
    JS_PopGCRef(ctx, &headers_input_ref);
    JS_PopGCRef(ctx, &global_ref);
    JS_PopGCRef(ctx, &response_ref);
    return JS_EXCEPTION;
}

static JSValue rr_json_parse(JSContext *ctx, JSValue text_value)
{
    JSGCRef text_ref;
    JSGCRef global_ref;
    JSGCRef json_ref;
    JSGCRef parse_ref;
    JSValue *rooted_text;
    JSValue *global_obj;
    JSValue *json_obj;
    JSValue *parse_fn;
    JSValue result = JS_EXCEPTION;

    rooted_text = JS_PushGCRef(ctx, &text_ref);
    global_obj = JS_PushGCRef(ctx, &global_ref);
    json_obj = JS_PushGCRef(ctx, &json_ref);
    parse_fn = JS_PushGCRef(ctx, &parse_ref);
    *rooted_text = text_value;
    *global_obj = JS_GetGlobalObject(ctx);
    *json_obj = JS_UNDEFINED;
    *parse_fn = JS_UNDEFINED;
    if (JS_IsException(*global_obj)) {
        goto done;
    }
    *json_obj = JS_GetPropertyStr(ctx, *global_obj, "JSON");
    if (JS_IsException(*json_obj) || !rr_is_object(ctx, *json_obj)) {
        goto done;
    }
    *parse_fn = JS_GetPropertyStr(ctx, *json_obj, "parse");
    if (JS_IsException(*parse_fn) || !JS_IsFunction(ctx, *parse_fn)) {
        goto done;
    }
    result = rr_call_function(ctx, *parse_fn, *json_obj, 1, rooted_text);

done:
    JS_PopGCRef(ctx, &parse_ref);
    JS_PopGCRef(ctx, &json_ref);
    JS_PopGCRef(ctx, &global_ref);
    JS_PopGCRef(ctx, &text_ref);
    return result;
}

static JSValue rr_json_stringify(JSContext *ctx, JSValue value)
{
    JSGCRef value_ref;
    JSGCRef global_ref;
    JSGCRef json_ref;
    JSGCRef stringify_ref;
    JSValue *rooted_value;
    JSValue *global_obj;
    JSValue *json_obj;
    JSValue *stringify_fn;
    JSValue result = JS_EXCEPTION;

    rooted_value = JS_PushGCRef(ctx, &value_ref);
    global_obj = JS_PushGCRef(ctx, &global_ref);
    json_obj = JS_PushGCRef(ctx, &json_ref);
    stringify_fn = JS_PushGCRef(ctx, &stringify_ref);
    *rooted_value = value;
    *global_obj = JS_GetGlobalObject(ctx);
    *json_obj = JS_UNDEFINED;
    *stringify_fn = JS_UNDEFINED;
    if (JS_IsException(*global_obj)) {
        goto done;
    }
    *json_obj = JS_GetPropertyStr(ctx, *global_obj, "JSON");
    if (JS_IsException(*json_obj) || !rr_is_object(ctx, *json_obj)) {
        goto done;
    }
    *stringify_fn = JS_GetPropertyStr(ctx, *json_obj, "stringify");
    if (JS_IsException(*stringify_fn) || !JS_IsFunction(ctx, *stringify_fn)) {
        goto done;
    }
    result = rr_call_function(ctx, *stringify_fn, *json_obj, 1, rooted_value);

done:
    JS_PopGCRef(ctx, &stringify_ref);
    JS_PopGCRef(ctx, &json_ref);
    JS_PopGCRef(ctx, &global_ref);
    JS_PopGCRef(ctx, &value_ref);
    return result;
}

static JSValue rr_make_text_result(JSContext *ctx, JSValue target_value, const char *api_name)
{
    JSGCRef body_ref;
    JSValue *body_value;
    char *text = NULL;
    size_t text_len = 0;
    JSValue result = JS_EXCEPTION;

    body_value = JS_PushGCRef(ctx, &body_ref);
    *body_value = JS_GetPropertyStr(ctx, target_value, "body");
    if (JS_IsException(*body_value)) {
        goto done;
    }
    if (JS_IsUndefined(*body_value) || JS_IsNull(*body_value)) {
        result = JS_NewString(ctx, "");
        goto done;
    }
    if (esp32_mquickjs_stream_read_all_text(ctx, *body_value, api_name, &text, &text_len) != 0) {
        goto done;
    }
    result = JS_NewStringLen(ctx, text, text_len);
    if (!JS_IsException(result)) {
        esp32_mquickjs_stream_close_value(ctx, *body_value);
    }

done:
    heap_caps_free(text);
    JS_PopGCRef(ctx, &body_ref);
    return result;
}

static JSValue rr_make_request_from_args(JSContext *ctx, JSValue global_obj, int argc, JSValue *argv)
{
    JSGCRef global_ref;
    JSGCRef query_ref;
    JSGCRef init_ref;
    JSGCRef method_ref;
    JSGCRef headers_ref;
    JSGCRef body_ref;
    JSValue *rooted_global;
    JSValue *query_value;
    JSValue *init_value;
    JSValue *method_value;
    JSValue *headers_value;
    JSValue *body_value;
    char *method = NULL;
    char *url = NULL;
    char *path = NULL;
    char *route = NULL;
    char *mount_path = NULL;
    char *relative_path = NULL;
    char *query_string = NULL;
    JSValue result = JS_EXCEPTION;

    rooted_global = JS_PushGCRef(ctx, &global_ref);
    query_value = JS_PushGCRef(ctx, &query_ref);
    init_value = JS_PushGCRef(ctx, &init_ref);
    method_value = JS_PushGCRef(ctx, &method_ref);
    headers_value = JS_PushGCRef(ctx, &headers_ref);
    body_value = JS_PushGCRef(ctx, &body_ref);
    *rooted_global = global_obj;
    *query_value = JS_UNDEFINED;
    *init_value = argc >= 2 ? argv[1] : JS_UNDEFINED;
    *method_value = JS_UNDEFINED;
    *headers_value = JS_UNDEFINED;
    *body_value = JS_UNDEFINED;

