99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_request_response.c
    if (argc < 1) {
        result = JS_ThrowTypeError(ctx, "Request(input, init?) expects a URL or Request");
        goto done;
    }

    if (esp32_mquickjs_is_request_object(ctx, argv[0])) {
        JSGCRef url_ref;
        JSGCRef path_ref;
        JSGCRef route_ref;
        JSGCRef mount_path_ref;
        JSGCRef relative_path_ref;
        JSGCRef query_string_ref;
        JSValue *url_value;
        JSValue *path_value;
        JSValue *route_value;
        JSValue *mount_path_value;
        JSValue *relative_path_value;
        JSValue *query_string_value;
        url_value = JS_PushGCRef(ctx, &url_ref);
        path_value = JS_PushGCRef(ctx, &path_ref);
        route_value = JS_PushGCRef(ctx, &route_ref);
        mount_path_value = JS_PushGCRef(ctx, &mount_path_ref);
        relative_path_value = JS_PushGCRef(ctx, &relative_path_ref);
        query_string_value = JS_PushGCRef(ctx, &query_string_ref);
        *method_value = JS_GetPropertyStr(ctx, argv[0], "method");
        *headers_value = JS_GetPropertyStr(ctx, argv[0], "headers");
        *body_value = JS_GetPropertyStr(ctx, argv[0], "body");
        *url_value = JS_GetPropertyStr(ctx, argv[0], "url");
        *path_value = JS_GetPropertyStr(ctx, argv[0], "path");
        *route_value = JS_GetPropertyStr(ctx, argv[0], "route");
        *mount_path_value = JS_GetPropertyStr(ctx, argv[0], "mountPath");
        *relative_path_value = JS_GetPropertyStr(ctx, argv[0], "relativePath");
        *query_string_value = JS_GetPropertyStr(ctx, argv[0], "queryString");
        *query_value = JS_GetPropertyStr(ctx, argv[0], "query");
        if (JS_IsException(*method_value) || JS_IsException(*headers_value) || JS_IsException(*body_value) ||
            JS_IsException(*url_value) || JS_IsException(*path_value) || JS_IsException(*route_value) ||
            JS_IsException(*mount_path_value) || JS_IsException(*relative_path_value) ||
            JS_IsException(*query_string_value) ||
            JS_IsException(*query_value)) {
            JS_PopGCRef(ctx, &query_string_ref);
            JS_PopGCRef(ctx, &relative_path_ref);
            JS_PopGCRef(ctx, &mount_path_ref);
            JS_PopGCRef(ctx, &route_ref);
            JS_PopGCRef(ctx, &path_ref);
            JS_PopGCRef(ctx, &url_ref);
            goto done;
        }
        method = rr_value_to_string_copy(ctx, *method_value);
        url = rr_value_to_string_copy(ctx, *url_value);
        path = rr_value_to_string_copy(ctx, *path_value);
        route = rr_value_to_string_copy(ctx, *route_value);
        mount_path = rr_value_to_string_copy(ctx, *mount_path_value);
        relative_path = rr_value_to_string_copy(ctx, *relative_path_value);
        query_string = rr_value_to_string_copy(ctx, *query_string_value);
        if (method == NULL || url == NULL || path == NULL || route == NULL || mount_path == NULL ||
            relative_path == NULL || query_string == NULL) {
            JS_ThrowOutOfMemory(ctx);
        }
        JS_PopGCRef(ctx, &query_string_ref);
        JS_PopGCRef(ctx, &relative_path_ref);
        JS_PopGCRef(ctx, &mount_path_ref);
        JS_PopGCRef(ctx, &route_ref);
        JS_PopGCRef(ctx, &path_ref);
        JS_PopGCRef(ctx, &url_ref);
        if (method == NULL || url == NULL || path == NULL || route == NULL || mount_path == NULL ||
            relative_path == NULL || query_string == NULL) {
            goto done;
        }
    } else if (JS_IsString(ctx, argv[0])) {
        JSCStringBuf url_buf;
        const char *url_str = JS_ToCString(ctx, argv[0], &url_buf);

        if (url_str == NULL) {
            goto done;
        }
        url = rr_strdup(url_str);
        method = rr_strdup("GET");
        route = NULL;
        mount_path = rr_strdup("");
        relative_path = rr_strdup("");
        if (url == NULL || method == NULL || rr_parse_url_parts(ctx, url_str, &path, &query_string, query_value) != 0) {
            JS_ThrowOutOfMemory(ctx);
            goto done;
        }
    } else {
        result = JS_ThrowTypeError(ctx, "Request(input, init?) expects a URL string or Request");
        goto done;
    }

    if (argc >= 2 && !JS_IsUndefined(*init_value) && !JS_IsNull(*init_value)) {
        JSGCRef method_init_ref;
        JSGCRef headers_init_ref;
        JSGCRef body_init_ref;
        JSValue *method_init;
        JSValue *headers_init;
        JSValue *body_init;

        if (!rr_is_object(ctx, *init_value)) {
            result = JS_ThrowTypeError(ctx, "Request(input, init) expects init to be an object");
            goto done;
        }
        method_init = JS_PushGCRef(ctx, &method_init_ref);
        headers_init = JS_PushGCRef(ctx, &headers_init_ref);
        body_init = JS_PushGCRef(ctx, &body_init_ref);
        *method_init = JS_GetPropertyStr(ctx, *init_value, "method");
        *headers_init = JS_GetPropertyStr(ctx, *init_value, "headers");
        *body_init = JS_GetPropertyStr(ctx, *init_value, "body");
        if (JS_IsException(*method_init) || JS_IsException(*headers_init) || JS_IsException(*body_init)) {
            JS_PopGCRef(ctx, &body_init_ref);
            JS_PopGCRef(ctx, &headers_init_ref);
            JS_PopGCRef(ctx, &method_init_ref);
            goto done;
        }
        if (!JS_IsUndefined(*method_init) && !JS_IsNull(*method_init)) {
            JSCStringBuf method_buf;
            const char *method_str;

            if (!JS_IsString(ctx, *method_init)) {
                result = JS_ThrowTypeError(ctx, "Request(input, init.method) expects a string");
                JS_PopGCRef(ctx, &body_init_ref);
                JS_PopGCRef(ctx, &headers_init_ref);
                JS_PopGCRef(ctx, &method_init_ref);
                goto done;
            }
            method_str = JS_ToCString(ctx, *method_init, &method_buf);
            if (method_str == NULL) {
                JS_PopGCRef(ctx, &body_init_ref);
                JS_PopGCRef(ctx, &headers_init_ref);
                JS_PopGCRef(ctx, &method_init_ref);
                goto done;
            }
            heap_caps_free(method);
            method = rr_strdup(method_str);
        }
        if (!JS_IsUndefined(*headers_init) && !JS_IsNull(*headers_init)) {
            *headers_value = *headers_init;
        }
        if (!JS_IsUndefined(*body_init) && !JS_IsNull(*body_init)) {
            *body_value = *body_init;
        }
        JS_PopGCRef(ctx, &body_init_ref);
        JS_PopGCRef(ctx, &headers_init_ref);
        JS_PopGCRef(ctx, &method_init_ref);
    }

    result = esp32_mquickjs_make_request_object(ctx,
                                                *rooted_global,
                                                method != NULL ? method : "GET",
                                                url != NULL ? url : "",
                                                path != NULL ? path : "/",
                                                route != NULL ? route : (path != NULL ? path : "/"),
                                                mount_path != NULL ? mount_path : "",
                                                relative_path != NULL ? relative_path : "",
                                                query_string != NULL ? query_string : "",
                                                *query_value,
                                                *headers_value,
                                                *body_value);

done:
    heap_caps_free(method);
    heap_caps_free(url);
    heap_caps_free(path);
    heap_caps_free(route);
    heap_caps_free(mount_path);
    heap_caps_free(relative_path);
    heap_caps_free(query_string);
    JS_PopGCRef(ctx, &body_ref);
    JS_PopGCRef(ctx, &headers_ref);
    JS_PopGCRef(ctx, &method_ref);
    JS_PopGCRef(ctx, &init_ref);
    JS_PopGCRef(ctx, &query_ref);
    JS_PopGCRef(ctx, &global_ref);
    return result;
}

static JSValue rr_make_response_from_args(JSContext *ctx, JSValue global_obj, int argc, JSValue *argv)
{
    JSGCRef global_ref;
    JSGCRef init_ref;
    JSGCRef status_ref;
    JSGCRef status_text_ref;
    JSGCRef headers_ref;
    JSGCRef url_ref;
    JSValue *rooted_global;
    JSValue *init_value;
    JSValue *status_value;
    JSValue *status_text_value;
    JSValue *headers_value;
    JSValue *url_value;
    int status = 200;
    char *status_text = NULL;
    char *url = NULL;
    JSValue result = JS_EXCEPTION;

    rooted_global = JS_PushGCRef(ctx, &global_ref);
    init_value = JS_PushGCRef(ctx, &init_ref);
    status_value = JS_PushGCRef(ctx, &status_ref);
    status_text_value = JS_PushGCRef(ctx, &status_text_ref);
    headers_value = JS_PushGCRef(ctx, &headers_ref);
    url_value = JS_PushGCRef(ctx, &url_ref);
    *rooted_global = global_obj;
    *init_value = argc >= 2 ? argv[1] : JS_UNDEFINED;
    *status_value = JS_UNDEFINED;
    *status_text_value = JS_UNDEFINED;
    *headers_value = JS_UNDEFINED;
    *url_value = JS_UNDEFINED;

    if (argc >= 2 && !JS_IsUndefined(*init_value) && !JS_IsNull(*init_value)) {
        JSCStringBuf text_buf;
        const char *text_str;

        if (!rr_is_object(ctx, *init_value)) {
            result = JS_ThrowTypeError(ctx, "Response(body, init) expects init to be an object");
            goto done;
        }
        *status_value = JS_GetPropertyStr(ctx, *init_value, "status");
        *status_text_value = JS_GetPropertyStr(ctx, *init_value, "statusText");
        *headers_value = JS_GetPropertyStr(ctx, *init_value, "headers");
        *url_value = JS_GetPropertyStr(ctx, *init_value, "url");
        if (JS_IsException(*status_value) || JS_IsException(*status_text_value) ||
            JS_IsException(*headers_value) || JS_IsException(*url_value)) {
            goto done;
        }
        if (!JS_IsUndefined(*status_value) && !JS_IsNull(*status_value) &&
            JS_ToInt32(ctx, &status, *status_value) != 0) {
            result = JS_ThrowTypeError(ctx, "Response(body, init.status) expects an integer");
            goto done;
        }
        if (!JS_IsUndefined(*status_text_value) && !JS_IsNull(*status_text_value)) {
            text_str = JS_ToCString(ctx, *status_text_value, &text_buf);
            if (text_str == NULL) {
                goto done;
            }
            status_text = rr_strdup(text_str);
        }
        if (!JS_IsUndefined(*url_value) && !JS_IsNull(*url_value)) {
            text_str = JS_ToCString(ctx, *url_value, &text_buf);
            if (text_str == NULL) {
                goto done;
            }
            url = rr_strdup(text_str);
        }
    }

    result = esp32_mquickjs_make_response_object(ctx,
                                                 *rooted_global,
                                                 status,
                                                 status_text,
                                                 url,
                                                 *headers_value,
                                                 argc >= 1 ? argv[0] : JS_UNDEFINED);

done:
    heap_caps_free(status_text);
    heap_caps_free(url);
    JS_PopGCRef(ctx, &url_ref);
    JS_PopGCRef(ctx, &headers_ref);
    JS_PopGCRef(ctx, &status_text_ref);
    JS_PopGCRef(ctx, &status_ref);
    JS_PopGCRef(ctx, &init_ref);
    JS_PopGCRef(ctx, &global_ref);
    return result;
}

static JSValue rr_make_response_text_factory(JSContext *ctx, JSValue global_obj, int argc, JSValue *argv)
{
    JSGCRef global_ref;
    JSGCRef body_ref;
    JSValue *rooted_global;
    JSValue *body_stream;
    JSCStringBuf text_buf;
    const char *text;
    JSValue result;

    rooted_global = JS_PushGCRef(ctx, &global_ref);
    body_stream = JS_PushGCRef(ctx, &body_ref);
    *rooted_global = global_obj;
    *body_stream = JS_UNDEFINED;
    text = argc >= 1 ? JS_ToCString(ctx, argv[0], &text_buf) : "";
    if (argc >= 1 && text == NULL) {
        result = JS_EXCEPTION;
        goto done;
    }
    *body_stream = esp32_mquickjs_make_text_body_stream(ctx, *rooted_global, text != NULL ? text : "");
    if (JS_IsException(*body_stream)) {
        result = JS_EXCEPTION;
        goto done;
    }
    result = rr_make_response_from_args(
        ctx,
        *rooted_global,
        argc >= 2 ? 2 : 1,
        (JSValue[]){*body_stream, argc >= 2 ? argv[1] : JS_UNDEFINED});

done:
    JS_PopGCRef(ctx, &body_ref);
    JS_PopGCRef(ctx, &global_ref);
    return result;
}

static JSValue rr_make_response_json_factory(JSContext *ctx, JSValue global_obj, int argc, JSValue *argv)
{
    JSGCRef global_ref;
    JSGCRef text_ref;
    JSGCRef body_ref;
    JSGCRef init_ref;
    JSGCRef headers_init_ref;
    JSGCRef headers_ref;
    JSGCRef plain_ref;
    JSValue *rooted_global;
    JSValue *text_value;
    JSValue *body_stream;
    JSValue *init_obj;
    JSValue *headers_init;
    JSValue *headers_obj;
    JSValue *plain_headers;
    JSCStringBuf text_buf;
    const char *text;
    JSValue result = JS_EXCEPTION;

    rooted_global = JS_PushGCRef(ctx, &global_ref);
    text_value = JS_PushGCRef(ctx, &text_ref);
    body_stream = JS_PushGCRef(ctx, &body_ref);
    init_obj = JS_PushGCRef(ctx, &init_ref);
    headers_init = JS_PushGCRef(ctx, &headers_init_ref);
    headers_obj = JS_PushGCRef(ctx, &headers_ref);
    plain_headers = JS_PushGCRef(ctx, &plain_ref);
    *rooted_global = global_obj;
    *text_value = JS_UNDEFINED;
    *body_stream = JS_UNDEFINED;
    *init_obj = JS_UNDEFINED;
    *headers_init = JS_UNDEFINED;
    *headers_obj = JS_UNDEFINED;
    *plain_headers = JS_UNDEFINED;

    *text_value = rr_json_stringify(ctx, argc >= 1 ? argv[0] : JS_NULL);
    if (JS_IsException(*text_value)) {
        goto done;
    }
    text = JS_ToCString(ctx, *text_value, &text_buf);
    if (text == NULL) {
        goto done;
    }
    *body_stream = esp32_mquickjs_make_text_body_stream(ctx, *rooted_global, text);
    if (JS_IsException(*body_stream)) {
        goto done;
    }

