99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_request_response.c
    *init_obj = JS_NewObject(ctx);
    if (JS_IsException(*init_obj)) {
        goto done;
    }
    if (argc >= 2 && rr_is_object(ctx, argv[1])) {
        if (rr_copy_object_properties(ctx, &argv[1], init_obj, false) != 0) {
            goto done;
        }
        *headers_init = JS_GetPropertyStr(ctx, argv[1], "headers");
        if (JS_IsException(*headers_init)) {
            goto done;
        }
    }

    *headers_obj = esp32_mquickjs_make_headers_object(ctx, *rooted_global, *headers_init);
    if (JS_IsException(*headers_obj)) {
        goto done;
    }
    *plain_headers = esp32_mquickjs_headers_to_plain_object(ctx, *headers_obj);
    if (JS_IsException(*plain_headers) ||
        !esp32_mquickjs_set_property(ctx, *plain_headers, "content-type",
                                     JS_NewString(ctx, "application/json; charset=utf-8")) ||
        !esp32_mquickjs_set_property(ctx, *init_obj, "headers", *plain_headers)) {
        goto done;
    }

    result = rr_make_response_from_args(
        ctx,
        *rooted_global,
        2,
        (JSValue[]){*body_stream, *init_obj});

done:
    JS_PopGCRef(ctx, &plain_ref);
    JS_PopGCRef(ctx, &headers_ref);
    JS_PopGCRef(ctx, &headers_init_ref);
    JS_PopGCRef(ctx, &init_ref);
    JS_PopGCRef(ctx, &body_ref);
    JS_PopGCRef(ctx, &text_ref);
    JS_PopGCRef(ctx, &global_ref);
    return result;
}

static JSValue rr_make_response_stream_factory(JSContext *ctx, JSValue global_obj, int argc, JSValue *argv)
{
    JSGCRef global_ref;
    JSValue *rooted_global;
    JSValue result;

    rooted_global = JS_PushGCRef(ctx, &global_ref);
    *rooted_global = global_obj;
    if (argc < 1 || !esp32_mquickjs_stream_is_stream(ctx, argv[0])) {
        result = JS_ThrowTypeError(ctx, "Response.stream(stream, options?) expects a Stream");
    } else {
        result = rr_make_response_from_args(
            ctx,
            *rooted_global,
            argc >= 2 ? 2 : 1,
            (JSValue[]){argv[0], argc >= 2 ? argv[1] : JS_UNDEFINED});
    }
    JS_PopGCRef(ctx, &global_ref);
    return result;
}

static JSValue rr_require_global_object(JSContext *ctx)
{
    return rr_get_global_object(ctx);
}

static JSValue rr_require_headers_this(JSContext *ctx, JSValue this_value, const char *api_name)
{
    if (!esp32_mquickjs_is_headers_object(ctx, this_value)) {
        return JS_ThrowTypeError(ctx, "%s expects a Headers object", api_name);
    }
    return this_value;
}

static JSValue rr_require_request_this(JSContext *ctx, JSValue this_value, const char *api_name)
{
    if (!esp32_mquickjs_is_request_object(ctx, this_value)) {
        return JS_ThrowTypeError(ctx, "%s expects a Request object", api_name);
    }
    return this_value;
}

static JSValue rr_require_response_this(JSContext *ctx, JSValue this_value, const char *api_name)
{
    if (!esp32_mquickjs_is_response_object(ctx, this_value)) {
        return JS_ThrowTypeError(ctx, "%s expects a Response object", api_name);
    }
    return this_value;
}

static int rr_require_constructor(int argc, const char *class_name)
{
    if (!(argc & FRAME_CF_CTOR)) {
        return -1;
    }
    (void)class_name;
    return argc & ~FRAME_CF_CTOR;
}

JSValue js_headers_constructor(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    JSGCRef global_ref;
    JSValue *global_obj;
    JSValue result;
    int actual_argc = rr_require_constructor(argc, "Headers");

    (void)this_val;
    if (actual_argc < 0) {
        return JS_ThrowTypeError(ctx, "Headers must be called with new");
    }
    global_obj = JS_PushGCRef(ctx, &global_ref);
    *global_obj = rr_require_global_object(ctx);
    if (JS_IsException(*global_obj)) {
        JS_PopGCRef(ctx, &global_ref);
        return JS_EXCEPTION;
    }
    result = esp32_mquickjs_make_headers_object(ctx, *global_obj, actual_argc >= 1 ? argv[0] : JS_UNDEFINED);
    JS_PopGCRef(ctx, &global_ref);
    return result;
}

JSValue js_headers_get(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    JSGCRef store_ref;
    JSValue *store_obj;
    JSCStringBuf key_buf;
    const char *key;
    char *normalized;
    JSValue value;

    if (JS_IsException(rr_require_headers_this(ctx, *this_val, "Headers.get(name)"))) {
        return JS_EXCEPTION;
    }
    if (argc < 1 || !JS_IsString(ctx, argv[0])) {
        return JS_ThrowTypeError(ctx, "Headers.get(name) expects a string");
    }
    key = JS_ToCString(ctx, argv[0], &key_buf);
    if (key == NULL) {
        return JS_EXCEPTION;
    }
    normalized = rr_normalize_header_key(key);
    if (normalized == NULL) {
        return JS_ThrowOutOfMemory(ctx);
    }
    store_obj = JS_PushGCRef(ctx, &store_ref);
    *store_obj = rr_get_headers_store(ctx, *this_val);
    value = JS_GetPropertyStr(ctx, *store_obj, normalized);
    heap_caps_free(normalized);
    JS_PopGCRef(ctx, &store_ref);
    return JS_IsUndefined(value) ? JS_NULL : value;
}

JSValue js_headers_set(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    JSGCRef store_ref;
    JSValue *store_obj;
    JSCStringBuf key_buf;
    JSCStringBuf value_buf;
    const char *key;
    const char *value;
    char *normalized;
    char *value_copy;

    if (JS_IsException(rr_require_headers_this(ctx, *this_val, "Headers.set(name, value)"))) {
        return JS_EXCEPTION;
    }
    if (argc < 2 || !JS_IsString(ctx, argv[0])) {
        return JS_ThrowTypeError(ctx, "Headers.set(name, value) expects a name and value");
    }
    key = JS_ToCString(ctx, argv[0], &key_buf);
    if (key == NULL) {
        return JS_EXCEPTION;
    }
    normalized = rr_normalize_header_key(key);
    if (normalized == NULL) {
        return JS_ThrowOutOfMemory(ctx);
    }
    value = JS_ToCString(ctx, argv[1], &value_buf);
    if (value == NULL) {
        heap_caps_free(normalized);
        return JS_EXCEPTION;
    }
    value_copy = rr_strdup(value);
    if (value_copy == NULL) {
        heap_caps_free(normalized);
        return JS_ThrowOutOfMemory(ctx);
    }
    store_obj = JS_PushGCRef(ctx, &store_ref);
    *store_obj = rr_get_headers_store(ctx, *this_val);
    if (!esp32_mquickjs_set_property(ctx, *store_obj, normalized, JS_NewString(ctx, value_copy))) {
        heap_caps_free(value_copy);
        heap_caps_free(normalized);
        JS_PopGCRef(ctx, &store_ref);
        return JS_EXCEPTION;
    }
    heap_caps_free(value_copy);
    heap_caps_free(normalized);
    JS_PopGCRef(ctx, &store_ref);
    return *this_val;
}

JSValue js_headers_has(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    JSGCRef store_ref;
    JSValue *store_obj;
    JSCStringBuf key_buf;
    const char *key;
    char *normalized;
    JSValue value;

    if (JS_IsException(rr_require_headers_this(ctx, *this_val, "Headers.has(name)"))) {
        return JS_EXCEPTION;
    }
    if (argc < 1 || !JS_IsString(ctx, argv[0])) {
        return JS_ThrowTypeError(ctx, "Headers.has(name) expects a string");
    }
    key = JS_ToCString(ctx, argv[0], &key_buf);
    if (key == NULL) {
        return JS_EXCEPTION;
    }
    normalized = rr_normalize_header_key(key);
    if (normalized == NULL) {
        return JS_ThrowOutOfMemory(ctx);
    }
    store_obj = JS_PushGCRef(ctx, &store_ref);
    *store_obj = rr_get_headers_store(ctx, *this_val);
    value = JS_GetPropertyStr(ctx, *store_obj, normalized);
    heap_caps_free(normalized);
    JS_PopGCRef(ctx, &store_ref);
    return JS_NewBool(!JS_IsUndefined(value) && !JS_IsNull(value));
}

JSValue js_headers_delete(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    JSGCRef store_ref;
    JSValue *store_obj;
    JSCStringBuf key_buf;
    const char *key;
    char *normalized;
    JSValue previous;
    bool existed;

    if (JS_IsException(rr_require_headers_this(ctx, *this_val, "Headers.delete(name)"))) {
        return JS_EXCEPTION;
    }
    if (argc < 1 || !JS_IsString(ctx, argv[0])) {
        return JS_ThrowTypeError(ctx, "Headers.delete(name) expects a string");
    }
    key = JS_ToCString(ctx, argv[0], &key_buf);
    if (key == NULL) {
        return JS_EXCEPTION;
    }
    normalized = rr_normalize_header_key(key);
    if (normalized == NULL) {
        return JS_ThrowOutOfMemory(ctx);
    }
    store_obj = JS_PushGCRef(ctx, &store_ref);
    *store_obj = rr_get_headers_store(ctx, *this_val);
    previous = JS_GetPropertyStr(ctx, *store_obj, normalized);
    existed = !JS_IsException(previous) && !JS_IsUndefined(previous) && !JS_IsNull(previous);
    if (JS_IsException(previous) ||
        !esp32_mquickjs_set_property(ctx, *store_obj, normalized, JS_UNDEFINED)) {
        heap_caps_free(normalized);
        JS_PopGCRef(ctx, &store_ref);
        return JS_EXCEPTION;
    }
    heap_caps_free(normalized);
    JS_PopGCRef(ctx, &store_ref);
    return JS_NewBool(existed);
}

