99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_request_response.c
JSValue js_headers_entries(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    JSGCRef array_ref;
    JSGCRef plain_ref;
    JSGCRef keys_ref;
    JSGCRef length_ref;
    JSValue *entries_array;
    JSValue *plain_obj;
    JSValue *keys_array;
    JSValue *length_value;
    int length = 0;
    int i;

    (void)argc;
    (void)argv;
    if (JS_IsException(rr_require_headers_this(ctx, *this_val, "Headers.entries()"))) {
        return JS_EXCEPTION;
    }
    entries_array = JS_PushGCRef(ctx, &array_ref);
    plain_obj = JS_PushGCRef(ctx, &plain_ref);
    keys_array = JS_PushGCRef(ctx, &keys_ref);
    length_value = JS_PushGCRef(ctx, &length_ref);
    *entries_array = JS_UNDEFINED;
    *plain_obj = esp32_mquickjs_headers_to_plain_object(ctx, *this_val);
    *keys_array = JS_UNDEFINED;
    *length_value = JS_UNDEFINED;
    if (JS_IsException(*plain_obj)) {
        goto fail;
    }
    *entries_array = JS_NewArray(ctx, 0);
    *keys_array = rr_get_object_keys(ctx, plain_obj);
    if (JS_IsException(*entries_array) || JS_IsException(*keys_array)) {
        goto fail;
    }
    *length_value = JS_GetPropertyStr(ctx, *keys_array, "length");
    if (JS_IsException(*length_value) || JS_ToInt32(ctx, &length, *length_value) != 0) {
        goto fail;
    }

    for (i = 0; i < length; ++i) {
        JSGCRef pair_ref;
        JSGCRef key_ref;
        JSGCRef value_ref;
        JSValue *pair;
        JSValue *key;
        JSValue *value;
        JSCStringBuf key_buf;
        const char *key_str;

        pair = JS_PushGCRef(ctx, &pair_ref);
        key = JS_PushGCRef(ctx, &key_ref);
        value = JS_PushGCRef(ctx, &value_ref);
        *pair = JS_NewArray(ctx, 0);
        *key = JS_GetPropertyUint32(ctx, *keys_array, (uint32_t)i);
        *value = JS_UNDEFINED;
        if (JS_IsException(*pair) || JS_IsException(*key)) {
            JS_PopGCRef(ctx, &value_ref);
            JS_PopGCRef(ctx, &key_ref);
            JS_PopGCRef(ctx, &pair_ref);
            goto fail;
        }
        key_str = JS_ToCString(ctx, *key, &key_buf);
        if (key_str == NULL) {
            JS_PopGCRef(ctx, &value_ref);
            JS_PopGCRef(ctx, &key_ref);
            JS_PopGCRef(ctx, &pair_ref);
            goto fail;
        }
        *value = JS_GetPropertyStr(ctx, *plain_obj, key_str);
        if (JS_IsException(*value) ||
            JS_IsException(JS_SetPropertyUint32(ctx, *pair, 0, *key)) ||
            JS_IsException(JS_SetPropertyUint32(ctx, *pair, 1, *value)) ||
            JS_IsException(JS_SetPropertyUint32(ctx, *entries_array, (uint32_t)i, *pair))) {
            JS_PopGCRef(ctx, &value_ref);
            JS_PopGCRef(ctx, &key_ref);
            JS_PopGCRef(ctx, &pair_ref);
            goto fail;
        }
        JS_PopGCRef(ctx, &value_ref);
        JS_PopGCRef(ctx, &key_ref);
        JS_PopGCRef(ctx, &pair_ref);
    }

    JS_PopGCRef(ctx, &length_ref);
    JS_PopGCRef(ctx, &keys_ref);
    JS_PopGCRef(ctx, &plain_ref);
    return JS_PopGCRef(ctx, &array_ref);

fail:
    JS_PopGCRef(ctx, &length_ref);
    JS_PopGCRef(ctx, &keys_ref);
    JS_PopGCRef(ctx, &plain_ref);
    JS_PopGCRef(ctx, &array_ref);
    return JS_EXCEPTION;
}

JSValue js_headers_toObject(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)argc;
    (void)argv;
    if (JS_IsException(rr_require_headers_this(ctx, *this_val, "Headers.toObject()"))) {
        return JS_EXCEPTION;
    }
    return esp32_mquickjs_headers_to_plain_object(ctx, *this_val);
}

JSValue js_request_constructor(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    JSGCRef global_ref;
    JSValue *global_obj;
    JSValue result;
    int actual_argc = rr_require_constructor(argc, "Request");

    (void)this_val;
    if (actual_argc < 0) {
        return JS_ThrowTypeError(ctx, "Request must be called with new");
    }
    global_obj = JS_PushGCRef(ctx, &global_ref);
    *global_obj = rr_require_global_object(ctx);
    if (JS_IsException(*global_obj)) {
        JS_PopGCRef(ctx, &global_ref);
        return JS_EXCEPTION;
    }
    result = rr_make_request_from_args(ctx, *global_obj, actual_argc, argv);
    JS_PopGCRef(ctx, &global_ref);
    return result;
}

JSValue js_request_text(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)argc;
    (void)argv;
    if (JS_IsException(rr_require_request_this(ctx, *this_val, "Request.text()"))) {
        return JS_EXCEPTION;
    }
    return rr_make_text_result(ctx, *this_val, "Request.text()");
}

JSValue js_request_json(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    JSValue text_value;

    (void)argc;
    (void)argv;
    if (JS_IsException(rr_require_request_this(ctx, *this_val, "Request.json()"))) {
        return JS_EXCEPTION;
    }
    text_value = rr_make_text_result(ctx, *this_val, "Request.json()");
    if (JS_IsException(text_value)) {
        return JS_EXCEPTION;
    }
    return rr_json_parse(ctx, text_value);
}

JSValue js_response_constructor(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    JSGCRef global_ref;
    JSValue *global_obj;
    JSValue result;
    int actual_argc = rr_require_constructor(argc, "Response");

    (void)this_val;
    if (actual_argc < 0) {
        return JS_ThrowTypeError(ctx, "Response must be called with new");
    }
    global_obj = JS_PushGCRef(ctx, &global_ref);
    *global_obj = rr_require_global_object(ctx);
    if (JS_IsException(*global_obj)) {
        JS_PopGCRef(ctx, &global_ref);
        return JS_EXCEPTION;
    }
    result = rr_make_response_from_args(ctx, *global_obj, actual_argc, argv);
    JS_PopGCRef(ctx, &global_ref);
    return result;
}

JSValue js_response_text(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)argc;
    (void)argv;
    if (JS_IsException(rr_require_response_this(ctx, *this_val, "Response.text()"))) {
        return JS_EXCEPTION;
    }
    return rr_make_text_result(ctx, *this_val, "Response.text()");
}

JSValue js_response_json(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    JSValue text_value;

    (void)argc;
    (void)argv;
    if (JS_IsException(rr_require_response_this(ctx, *this_val, "Response.json()"))) {
        return JS_EXCEPTION;
    }
    text_value = rr_make_text_result(ctx, *this_val, "Response.json()");
    if (JS_IsException(text_value)) {
        return JS_EXCEPTION;
    }
    return rr_json_parse(ctx, text_value);
}

JSValue js_response_make_text(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    JSGCRef global_ref;
    JSValue *global_obj;
    JSValue result;

    (void)this_val;
    global_obj = JS_PushGCRef(ctx, &global_ref);
    *global_obj = rr_require_global_object(ctx);
    if (JS_IsException(*global_obj)) {
        JS_PopGCRef(ctx, &global_ref);
        return JS_EXCEPTION;
    }
    result = rr_make_response_text_factory(ctx, *global_obj, argc, argv);
    JS_PopGCRef(ctx, &global_ref);
    return result;
}

JSValue js_response_make_json(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    JSGCRef global_ref;
    JSValue *global_obj;
    JSValue result;

    (void)this_val;
    global_obj = JS_PushGCRef(ctx, &global_ref);
    *global_obj = rr_require_global_object(ctx);
    if (JS_IsException(*global_obj)) {
        JS_PopGCRef(ctx, &global_ref);
        return JS_EXCEPTION;
    }
    result = rr_make_response_json_factory(ctx, *global_obj, argc, argv);
    JS_PopGCRef(ctx, &global_ref);
    return result;
}

JSValue js_response_make_stream(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    JSGCRef global_ref;
    JSValue *global_obj;
    JSValue result;

    (void)this_val;
    global_obj = JS_PushGCRef(ctx, &global_ref);
    *global_obj = rr_require_global_object(ctx);
    if (JS_IsException(*global_obj)) {
        JS_PopGCRef(ctx, &global_ref);
        return JS_EXCEPTION;
    }
    result = rr_make_response_stream_factory(ctx, *global_obj, argc, argv);
    JS_PopGCRef(ctx, &global_ref);
    return result;
}
